import sys, math # добавление используемых модулей

try: 
	infilename = sys.argv [1] # читаем со второй позиции имя файла со входными данными 
	outfilename = sys.argv [2] # читаем с третьей позиции имя файла, куда будем записывать результирующие данные
except:
	print("Usage:", sys.argv[0], "infile  outfile") # если отсутствует какой либо файл, выводим ошибку 
	sys.exit (1) # завершаем выполнение программы 

ifile = open(infilename , "r") # открываем файл со входными данными для чтения
ofile = open(outfilename , "w") # открываем файл для вывода результатов к записи 

def  myfunc(y): # метод, который считает значение функции в точке 
	if y  >= 0.0: # если у не отрицательный
		return y**5* math.exp(-y) # возвращаем у^5 степени, умноженное на е^(-у)
	else:
		return  0.0 # иначе 0

for line in ifile: # для каждой строки из файла со входящими данными 
	pair = line.split () # разбиваем строку по пробелу 
	x = float(pair [0]) # присваиваем переменной х значение первого столбца файла 
	y = float(pair [1]) # а у - значение второго столбца 
	fy = myfunc(y) # высчитываем значение функции в точке у
	ofile.write("%g %12.5g\n" % (x,fy)) # и записываем в файл форматированный вывод
ifile.close() # закроем доступ к файлам
ofile.close() # закроем доступ к файлам
