import sys, math # добавление используемых модулей

try: 
	infilename = sys.argv [1] # читаем со второй позиции имя файла со входными данными 
	outfilename = sys.argv [2] # читаем с третьей позиции имя файла, куда будем записывать результирующие данные
except:
	print("Usage:", sys.argv[0], "infile  outfile") # если отсутствует какой либо файл, выводим ошибку 
	sys.exit (1) # завершаем выполнение программы 

ifile = open(infilename , "r") # открываем файл со входными данными для чтения
ofile = open(outfilename , "w") # открываем файл для вывода результатов к записи 

for line in ifile: # для каждой строки из файла со входящими данными 
	substr = line.split () # разбиваем строку по пробелу 
	sum = 0 # переменная для суммы элементов в столбце
	for number in substr: # цикл по всем числам строки
		x = float(number) # преобразуем данные из строки в переменную
		sum += x # добавляем новое число к сумме
		ofile.write("%12.6f" % x) #записываем число из исходного файла
	ofile.write("%12.6f\n" % (sum / len(substr))) # записываем среднее значение
ifile.close() # закроем доступ к файлам
ofile.close() # закроем доступ к файлам
